experiments/optimization/drag_optimization_cube/foam_case/constant/adjointRASProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      RASProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// adjointRASModel   adjointSpalartAllmaras;

// adjointSpalartAllmarasCoeffs
// {
//     nSmooth           0;
//     zeroATCPatchTypes (wall patch);
//     maskType          pointCells;
// }

// adjointTurbulence on;

// printCoeffs       off;

adjointRASModel        adjointLaminar;

adjointTurbulence      off;

printCoeffs     off;


// ************************************************************************* //
